components/CFunctions.php

    public static function getLanguagesAll(){
        return \app\models\Languages::find()->where('is_display =:is_dispaly ORDER BY id',[':is_dispaly'=>Yii::$app->params['status_active']])->all();
---
SELECT * FROM `languages` WHERE is_display =1 ORDER BY id

    public static function getLanguagesActive($lc){
        return \app\models\Languages::find()->where('is_display =:is_display AND languageculture =:languageculture ORDER BY id',[':is_display'=>Yii::$app->params['status_active'], ':languageculture' =>$lc ])->one();
---
SELECT * FROM `languages` WHERE is_display =1 AND languageculture ='en' ORDER BY id

    public static function getSocials(){
        return \app\models\Socials::find()->where('is_display =:is_display ORDER BY id ASC',[':is_display'=>Yii::$app->params['status_active']])->all();
---
SELECT * FROM `socials` WHERE is_display =1 ORDER BY id ASC

    public static function getMenuCateogry() {
        return \app\models\Categories::find()->where('parent_id =:parent_id AND is_display =:is_display ORDER BY is_order ASC', [':parent_id' => 0,':is_display'=>Yii::$app->params['status_active']])->all();
---
SELECT * FROM `categories` WHERE parent_id =0 AND is_display =1 ORDER BY is_order ASC

    public static function getMenuSubCategory($cate_id) {
        return \app\models\Categories::find()->where('parent_id =:parent_id AND is_display =:is_display ORDER BY is_order DESC', [':parent_id' => $cate_id,':is_display'=>Yii::$app->params['status_active']])->all();
---
SELECT * FROM `categories` WHERE parent_id =1 AND is_display =1 ORDER BY is_order DESC

    public static function getBestSellingProducts() {
       $data = new ActiveDataProvider(
            [
                'query' => \app\models\Products::find()->where('is_status =:is_status ORDER BY `id` DESC LIMIT 10', [':is_status'=>Yii::$app->params['status_active']]),
                'pagination' => false,
            ]);
---
SELECT * FROM `products` WHERE is_status =1 ORDER BY `id` DESC LIMIT 10